[{'user': 'Happycloud#9096', 'message': 'Selling games from USA West coast. Paypal/Cashapp/Venmo preferred. https://i.imgur.com/PiSVQ0f.jpghttps://i.imgur.com/uGDL2ny.jpg'}, {'user': 'Amiar#8392', 'message': 'Selling all but the purple one. $130 each ($10 Discord discount!) https://imgur.com/gallery/SRgsUy9'}, {'user': 'Robert | Stack3r#7259', 'message': 'Selling a digital copy of doom eternal deluxe for PC, standard edition price'}, {'user': 'Yessey of Arabia#3764', 'message': '# Selling some my collection all in good condition. Nintendo:NES:Games:Indiana Jones and the last crusade: 70$Super Mario Bros Duck Hunt World Class Track Meet: 6$Jaws w/ Manual:14$Gauntlet 2: 6$Tecmo Bowl: 4$Tiger-Heli: 3$10 Yard Fight: 5$Blaster Master: 7$Tetris: 7$Adventure Island 2: 10$LOZ:Adventure of Link w/ Manual:20$LOZ:Adventure of Link: 15$Operation Wolf w/ Manual:8$1942 NES /w Manual: 16$Dragon Warrior: 10$Mickey Mousecapade: 7$Boulder Dash: 14$Top Gun: 4$Blades of steel: 4$Super Mario Bros, Duck Hunt, World Class Track Meet: 5$Super Mario Bros, Duck Hunt: 4$Super Mario Bros, Duck Hunt: 4$Super Mario Bros, Duck Hunt: 4$Gyromite: 6$Jackal: 10$Dr.Mario: 8$Super Mario Bros 2: 12$Fast Break: 3$Magmax: 4$Accessories:Nintendo Zapper: 11$SNES:Games:Jurassic Park: 8$Jurassic Park(Part 2): 24$Super Metroid: 40$Shadowrun SNES: 50$Judge Dredd SNES: 9$Illusion of Gaia: 25$Consoles:SNES Console w/ 1-controller: 65$  (almost no discoloration)SNES Console w/ 2-controllers 55$ (has yellowing)Accessories:Mario Paint Mouse: 8$N64:Consoles: N64 w/Expansion PAK, & 3 controllers (3games): 80$'}, {'user': 'orangeglo#6197', 'message': "if anyone has an OEM cobalt blue SP shell, I'd be interested"}, {'user': 'B23N#5844', 'message': 'Selling some solid silver nubs. These were the first I made and they fit best in a plastic shell. Spent $50 to have them made. Any offers around that I’ll take. Willing to eat the shipping cost. PM me!'}, {'user': 'Panda X#6337', 'message': "I am a sprite artist in the specialty of Pokemon sprites. Things I can do are:- Revamps- Devamps- Fusions (i.e. taking 2 Pokemon and fusing the sprites together)- Base Edited sprites (i.e. using a stock sprite to transform it into something the buyer desires.)- Overworld Trainer packs (front sprite + overworld movement sprites. This is largely just the walking animation) Things I will not do are:- Animations- Scratch sprites (i.e. sprites that are built from the ground up)- Tilesets- Non-Pokemon style sprites.Prices are around:- $13.30 USD for a single sprite- $16.50 USD for an overworld pack, with an additional $3.50 USD added for a back battle sprite/specialty overworld sprites like surfing, fishing, biking, ect.Here is a showcase of some sprites that I can make, to give you an idea of my scope: https://imgur.com/a/4UVydvjIf you would like any other information, or you're interested in commissioning me for spritework, please DM me."}, {'user': 'makho#2067', 'message': 'Famicon AGS-001 - $40Unit is stock and unmodded. There\'s a little bit of dust under the frontlight. Has a new aftermarket battery (not one of my mod batteries). Works great, I just have like 10 SPs and this one is already a duplicate.Black AGB-001 - $55Unit has Funnyplaying **V1** IPS Mod installed with brightness control (select + L/R). Works great except for the expected screen tearing. There is also a small black dot on the screen that I can\'t seem to get to go away (under the "E" in "GAME", look at the imgur album)Silver AGB-001 - $125Unit has aftermarket AGS-101 LCD installed with brightness control via the aurora ribbon mod (select + L/R to adjust brightness). Unit is rechargeable with 2000mAh (though it\'s been a few years so maybe less now) LiPo battery and Micro USB port. The machined aluminum shell is unfinished (i.e. no anodization or paint). It works fine as is but does show wear VERY easily and thus does already have quite a few scratches. It\'s usuable as-is, but I\'d recommend getting it painted or anodized. Has a new plastic lens. Most glass lenses don\'t seem to fit properly as the tolerances are a bit tight. Works great, I just don\'t like it.'}, {'user': 'makho#2067', 'message': 'WTS 1xAGS-001, 2xBacklit AGBs, 1xOXY-001 and 2xO3DS, Prices include CONUS shipping. No games, accessories, or chargers included unless otherwise specified (rechargeable systems do include batteries). All consoles have been cleaned internally and externally. More pictures available upon request'}]